{
"projects" : [
    {
        "id": 2,
        "title": "Python-爬蟲-天羅地網技術分析",
        "description":"一個基於 Python 股票查詢工具。<br>用戶可以獲取指定股票的基本資訊、價格變動，以及各種技術分析指標，輔助投資決策。",
        "image": "images\\tw_stock.jpg",
        "detailUrl":"project-detail.html?id=2",
        "fullDescription": "這個程式使用 Selenium 自動化瀏覽器進行網頁數據抓取，並利用 BeautifulSoup 對 HTML 結構進行解析。用戶可以輸入台灣股票代碼，程式會自動從網站抓取該股票的即時資訊，並提供多種技術指標選項供查詢，如多空力道、布林通道、天羅地網等。透過簡單的輸入選項，用戶即可輕鬆獲得技術指標的分析結果。",
        "technologies": ["Python", "Selenium", "BeautifulSoup", "WebDriver","time","os"],
        "challenges": "WebDriver 兼容性問題：<br>在不同版本的 Selenium 和 WebDriver 中，初始化方式可能有差異，需要對代碼進行調整以適應不同環境。<br>網頁結構變化：<br>目標網站的 HTML 結構如果發生變動，會影響數據抓取的準確性。<br>動態內容加載：<br>技術指標頁面在加載時可能使用了 JavaScript 延遲加載數據，需要加入適當等待機制，確保元素完全加載。<br>元素定位與數量不一致：<br>在提取技術指標數據時，經常會遇到元素數量不符預期的情況，這要求在代碼中進行更多的容錯處理。",
        "outcomes": "自動化數據抓取：<br>成功實現了對台灣股票資訊的自動化抓取和技術指標的即時查詢功能。<br>多指標支持：<br>用戶可通過簡單的選項輸入，查詢多種技術指標，滿足不同投資者的需求。<br>友好的用戶界面：<br>儘管是基於命令行操作，程式仍然提供了簡單易用的交互模式，讓用戶可以快速上手。<br>彈性擴展性：<br>該項目具有良好的擴展性，可以根據需求輕鬆添加更多的技術指標或數據處理功能。",
        "sampleCode":""
    },
    {
        "id": 1,
        "title": "Python-股票爬蟲&分析",
        "description": "基於Python股票爬蟲及分析工具，讓使用者自行選擇股票、買賣策略、開始&結束日期進行回測，透過圖表及文字訊息直觀了解交易策略的好壞。",
        "image": "images\\stock._backtestingjpg.jpg",
        "detailUrl": "project-detail.html?id=1",
        "fullDescription": "這個項目是一個股票交易回測系統，旨在幫助用戶使用多種技術指標來進行歷史數據的回測，從而評估不同交易策略的有效性。該系統允許用戶選擇12種不同的交易策略，並根據選擇的策略、股票代碼、起始資金、以及指定的時間範圍，對歷史股票數據進行模擬交易。回測結果包括資產曲線、交易紀錄、以及回測期間內的關鍵指標（如收益率、最大回撤等），幫助用戶在實際投資前評估策略的風險和潛在回報。。",
        "technologies": ["Python", "backtesting", "pandas", "numpy","talib","FinMind.data"],
        "challenges": "在項目開發過程中，我們遇到了一些具有挑戰性的問題，需要我們投入相當多的時間和精力來解決。首先，最大的挑戰之一是實現這12種不同的交易策略。每個策略都有其獨特的邏輯和計算方法，這需要我們深入理解各種技術指標，如KD指標、RSI、MACD等，並確保這些指標在不同情況下都能正確地應用於股票數據。我們必須反覆測試和調整策略的實現方式，以保證回測結果的準確性和穩定性其次，在打包程式的過程中，我們遇到了資源文件缺失的問題。由於使用了PyInstaller來打包最後，在依賴模組的兼容性上也遇到了一些問題。特別是 TA-Lib 等這些挑戰不僅增加了項目的複雜性，也促使我們提升了解決問題的能力，最終順利完成了這個功能強大的股票回測系統。。",
        "outcomes": "成功實現了一個功能齊全的股票回測系統，支持12種不同的交易策略，並能夠根據用戶輸入的參數進行靈活的回測操作通過 PyInstaller 成功將 Python 程式打包成單一的可執行文件，無需額外安裝 Python 環境，即可在 Windows 系統上運行。生成詳細的回測報告，包含資產變化曲線、交易紀錄、關鍵績效指標，幫助用戶在實際交易前對策略進行有效評估。",
        "sampleCode":""
    }
    ]
}